{
    "content": [
		{   
			"slug": "blackjack-royale-website",
            "year": "2025",
            "preview_img_url": "blackjack-royale-website-preview.jpg",
            "tumbnail_img_url": "blackjack-royale-website-tumbnail.jpg",
            "category": "WEBSITE",
            "title": "BLACKJACK ROYALE",
            "made_by": "Dylan Wintermans",
            "language": "HTML, CSS, JS & C#",
            "description": {
                "nl": "Blackjack Royale is een online multiplayer game waarin spelers samen blackjack spelen tegen de dealer, in groepen van maximaal 4 personen. Nodig vrienden uit of speel met onbekenden en maak gebruik van sociale functies zoals groeps-, privé- en globale chat. Dankzij de replay-functie kun je eerdere spellen terugkijken en je strategie aanscherpen. Vergelijk je statistieken met andere spelers en word de beste blackjackspeler.<br><br>Deze applicatie is ontwikkeld met React.js en Tailwind CSS voor de frontend en C# voor websockets en API’s. De CI/CD-pipeline automatiseert de deployment naar een server en een Docker-omgeving en voert unit-, integratie- en end-to-end tests uit. Voor databasebeheer wordt Entity Framework gebruikt.",
                "en": "Blackjack Royale is an online multiplayer game where players play blackjack together against the dealer in groups of up to 4 people. Invite friends or play with strangers and take advantage of social features such as group, private, and global chat. Thanks to the replay feature, you can review previous games and refine your strategy. Compare your stats with other players and become the best blackjack player.<br><br>This application is developed with React.js and Tailwind CSS for the frontend and C# for websockets and APIs. The CI/CD pipeline automates the deployment to a server and Docker environment and runs unit, integration, and end-to-end tests. Entity Framework is used for database management."
            },
            "images": [
                {
                    "img_url": "game.jpg",
                    "description": {
                        "nl": "2-persoons game met een afgesloten groepschat.",
                        "en": "2-player game with a private group chat."
                    }
                },
				{
                    "img_url": "lobby.jpg",
                    "description": {
                        "nl": "De lobby met lopende spellen, een vriendenlijst en globale chat.",
                        "en": "The lobby with ongoing games, a friends list, and global chat."
                    }
                },
                {
                    "img_url": "how-to-play.jpg",
                    "description": {
                        "nl": "Blackjack uitleg en spelregels.",
                        "en": "Blackjack explanation and rules."
                    }
                },
                {
                    "img_url": "leaderboard.jpg",
                    "description": {
                        "nl": "Leaderboard gebasseerd op verdiensten/verliezen ratio.",
                        "en": "Leaderboard based on earnings/losses ratio."
                    }
                },
                {
                    "img_url": "statistics.jpg",
                    "description": {
                        "nl": "Persoonlijke statistieken",
                        "en": "Personal statistics"
                    }
                },
                {
                    "img_url": "replays.jpg",
                    "description": {
                        "nl": "Overzicht van replays van spellen waar de speler aan deel heeft genomen.",
                        "en": "Overview of replays from games the player has participated in."
                    }
                },
                {
                    "img_url": "4-person-replay.jpg",
                    "description": {
                        "nl": "Replay van 4 personen, waarbij een speler zijn hand 4 keer heeft kunnen splitten.",
                        "en": "Replay of 4 players, where one player was able to split their hand 4 times."
                    }
                }
            ],
            "iframe": [
                {
                    "yt_url": "https://www.youtube-nocookie.com/embed/Itk9bU8szTg?rel=0"
                }
            ]
        },
        {
            "slug": "mazerace-game",
            "year": "2024",
            "preview_img_url": "mazerace-game-preview.jpg",
            "tumbnail_img_url": "mazerace-game-tumbnail.jpg",
            "category": "GAME",
            "title": "MAZERACE",
            "made_by": "Dylan Wintermans",
            "language": "PYTHON",
            "description": {
                "nl": "Start een spannend lokaal multiplayer-spel met MazeRace! Nodig een vriend uit voor een rechtstreekse race door 12 unieke doolhoven, elk met hun eigen uitdagingen. Kies uit 24 verschillende skins om je personage aan te passen en strijd voor de winst. Haal als eerste drie keer de eindstreep om als ultieme winnaar gekroond te worden.",
                "en": "Embark on an epic local multiplayer game with MazeRace! Challenge a friend to a head-to-head race through 12  unique mazes, each presenting different challenges. Choose from 24 distinctive skins to personalize your character and race to victory. Be the first to conquer the finish line three times to claim ultimate victory."
            },
			"images": [
                {
                    "img_url": "start_screen.jpg",
					"description": {
                        "nl": "Startscherm",
                        "en": "Startup screen"
                    }
                },
                {
                    "img_url": "end_screen.jpg",
					"description": {
                        "nl": "Eindscherm",
                        "en": "End screen"
                    }
                },
                {
                    "img_url": "cosmetics.jpg",
					"description": {
                        "nl": "Cosmetics",
                        "en": "Cosmetics"
                    }
                },
                {
                    "img_url": "level_preview_1.jpg",
					"description": {
                        "nl": "Levels 1-6",
                        "en": "Levels 1-6"
                    }
                },
                {
                    "img_url": "level_preview_2.jpg",
					"description": {
                        "nl": "Levels 7-12",
                        "en": "Levels 7-12"
                    }
                },
                {
                    "img_url": "level_5.jpg",
					"description": {
                        "nl": "Level 5",
                        "en": "Level 5"
                    }
                },
                {
                    "img_url": "level_10.jpg",
					"description": {
                        "nl": "Level 10",
                        "en": "Level 10"
                    }
                }
            ]
        },
        {
            "slug": "benphase-website",
            "year": "2023",
            "preview_img_url": "benphase-website-preview.jpg",
            "tumbnail_img_url": "benphase-website-tumbnail.jpg",
            "category": "WEBSITE",
            "title": "SUNPANEL MONITORING",
            "made_by": "Dylan Wintermans",
            "language": "HTML, CSS, JS, PHP & SQL",
            "description": {
                "nl": "Vanwege beveiligingsproblemen bij zonne-omvormers en de onnodige datastroom tussen de leverancier en de Enphase gateway heb ik zelf een website gemaakt om de opbrengsten van de zonnepanelen bij te houden. <br><br> Door gebruik te maken van deze beveiligingsproblemen kon ik gemakkelijk data uitlezen via de lokale API om zo gegevens bij te houden. De website wordt verder opgevuld met data van de OpenWeather API en deze API wordt elke 15 minuten benaderd voor actuele weersinformatie. De grafieken worden getekend met Chart.js. De website wordt lokaal gehost met een ODROID C4 waarop Ubuntu draait. Aan het einde van de dag wordt er automatisch een mail gestuurd met de opbrengst van de dag.",
                "en": "Due to security issues with solar inverters and the unnecessary flow of data between the supplier and the Enphase gateway, I created my own website to keep track of solar panel returns. <br><br> Taking advantage of these security issues, I was able to easily read data through the local API to track information. The website is further populated with data from the OpenWeather API and this API is accessed every 15 minutes for up-to-date weather information. The graphs are drawn with Chart.js. The website is hosted locally on an ODROID C4 running Ubuntu. At the end of the day, an email is automatically sent with the day's production."
            },
			"images": [
                {
                    "img_url": "home.jpg",
					"description": {
						"nl": "Homepagina met informatie, de status van de panelen en de grafiek van de dag.",
						"en": "Home page with information, panel status and graph of the day."
					}
                },
                {
                    "img_url": "dagoverzicht_1.jpg",
					"description": {
                        "nl": "Dagoverzicht (1) met weerbericht en kW per 15 minuten.",
                        "en": "Daily overview (1) with weather forecast and kW every 15 minutes."
                    }
                },
                {
                    "img_url": "dagoverzicht_2.jpg",
					"description": {
                        "nl": "Dagoverzicht (2) met weergrafiek en opbrengst per panneel.",
                        "en": "Daily view (2) with weather graph and returns per panel."
                    }
                },
                {
                    "img_url": "maandoverzicht.jpg",
					"description": {
                        "nl": "Maandoverzicht met de opbrengst en een weergrafiek.",
                        "en": "Monthly overview with returns and a weather graph."
                    }
                },
                {
                    "img_url": "jaaroverzicht.jpg",
					"description": {
                        "nl": "Jaaroverzicht met opbrengst per maand en van het hele jaar.",
                        "en": "Annual overview with returns by month and for the whole year."
                    }
                },
                {
                    "img_url": "status.jpg",
					"description": {
                        "nl": "De status per zonnepaneel en omvormer.",
                        "en": "Status by solar panel and inverter."
                    }
                }
            ]
        },
        {
            "slug": "iso-awareness-quiz-website",
            "year": "2023",
            "preview_img_url": "iso-awareness-quiz-website-preview.jpg",
            "tumbnail_img_url": "iso-awareness-quiz-website-tumbnail.jpg",
            "category": "WEBSITE",
            "title": "ISO AWARENESS-QUIZ",
            "made_by": "Dylan Wintermans",
            "language": "HTML, CSS, JS & PHP",
            "description": {
                "nl": "Dit project was mijn stageopdracht voor de afronding van mijn stage als Expert IT. De nadruk ligt hier op de ontwikkeling van de back-end (d.m.v. OOP). De website betreft een quiz om collega's te testen op hun kennis over bepaalde onderwerpen, in dit geval een ISO 27001-certificering. Met WordPress als CMS kunnen beheerders gemakkelijk quizzen toevoegen en door gebruik te maken van scoreborden worden medewerkers gemotiveerd om de scores van collega's te verbeteren.",
                "en": "This project was my internship assignment for the completion of my Expert IT internship. The emphasis here is on back-end development (using OOP). The website involves a quiz to test colleagues on their knowledge on certain topics, in this case an ISO 27001 certification. With WordPress as the CMS, administrators can easily add quizzes and by using scoreboards, employees are motivated to beat colleagues' scores."
            },
			"images": [
                {
                    "img_url": "scores.jpg",
					"description": {
                        "nl": "Score-overzicht in de back-end.",
                        "en": "Score overview in the back-end."
                    }
                },
                {
                    "img_url": "quizaanmaken.jpg",
					"description": {
                        "nl": "Antwoorden worden tijdens het maken van de quiz gehusseld.",
                        "en": "Answers are shuffled while taking the quiz."
                    }
                },
                {
                    "img_url": "userhighlight.jpg",
					"description": {
                        "nl": "De gebruiker 'Test' met zijn behaalde resultaten.",
                        "en": "The user 'Test' with his achieved results."
                    }
                },
                {
                    "img_url": "homepage.jpg",
					"description": {
                        "nl": "De homepagina voor gebruikers met hun eigen statistieken.",
                        "en": "The home page for users with their own statistics."
                    }
                },
                {
                    "img_url": "scoreboard.jpg",
					"description": {
                        "nl": "Scoreboard met de beste resultaten per quiz.",
                        "en": "Scoreboard showing best results for each quiz."
                    }
                }
            ]
        },
        {
            "slug": "portfolio-website",
            "year": "2023",
            "preview_img_url": "portfolio-website-preview.jpg",
            "tumbnail_img_url": "portfolio-website-tumbnail.jpg",
            "category": "WEBSITE",
            "title": "PORTFOLIO",
            "made_by": "Dylan Wintermans",
            "language": "HTML, CSS & JS",
            "description": {
                "nl": "Mijn portfolio wordt gehost op Github Pages. Om het proces te automatiseren maak ik gebruik van JSON-bestanden om de teksten en afbeeldingen weer te geven en dit kan ook in verschillende talen. Dit portfolio is een goed voorbeeld van de quote op de homepagina: '<i>Never spend 6 minutes doing something by hand when you can spend <s>6 hours failing</s> <b>6 days</b> to automate it.</i>'",
                "en": "My portfolio is hosted on Github Pages. To automate the process I use JSON files to display the texts and images, which can also be done in different languages. This portfolio is a good example of the quote on the homepage: '<i>Never spend 6 minutes doing something by hand when you can spend <s>6 hours failing</s> <b>6 days</b> to automate it.</i>'"
            },
			"images": [
                {
                    "img_url": "jsonpreview.jpg",
					"description": {
                        "nl": "JSON-bestand opzet.",
                        "en": "JSON file setup."
                    }
                },
                {
                    "img_url": "javascriptpreview.jpg",
					"description": {
                        "nl": "JSON-implementatie met Javascript.",
                        "en": "JSON implementation with Javascript."
                    }
                }
            ]
        },
        {
            "slug": "smarthome-iot",
            "year": "2023",
            "preview_img_url": "smarthome-iot-preview.jpg",
            "tumbnail_img_url": "smarthome-iot-tumbnail.jpg",
            "category": "INTERNET OF THINGS",
            "title": "SMARTHOME",
            "made_by": "Levano Moermond, Bennet Nura & Dylan Wintermans",
            "language": "HTML, CSS, JS, PHP, C++ & C#",
			"description": {
                "nl": "Voor het keuzevak 'HBO-voorbereiding' en 'Oriëntatie op applicatieontwikkeling' hebben wij een slim huis gemaakt.<br> - Deuren kunnen worden geopend door middel van een pinlock. De deuren gaan net als een airlocksysteem om de beurt open en dicht.<br> -  De lichten gaan automatisch aan of uit afhankelijk van detectie van de PIR-sensor.<br> -  Ramen kunnen met een timer automatisch geopend en gesloten worden.<br><br> Dit alles kan bediend worden via de C#-applicatie of via de website die gehost is op een webserver. Door middel van websockets wordt er een connectie gemaakt tussen de applicatie en de webserver. <br><br> Bennet was verantwoordelijk voor de deuren, Levano voor de lichten en arduinoconnectie en ik was verantwoordelijk voor de ramen en de websocketconnectie.",
                "en": "We created a SmartHouse in preparation for a Bacholor study.<br> - Doors can be opened by pinlock. Like an airlock system, the doors open and close in turn.<br> -  The lights turn on or off automatically depending on detection from the PIR sensor.<br> -  Windows can be opened and closed automatically with a timer.<br><br> All this can be operated through the C# application or through the website hosted on a webserver. Through websockets, a connection is made between the application and the webserver. <br><br> Bennet was responsible for the doors, Levano for the lights and arduino connection, and I was responsible for the windows and websocket connection."
            },
            "images": [
                {
                    "img_url": "1.jpg",
					"description": {
                        "nl": "",
                        "en": ""
                    }
                },
                {
                    "img_url": "2.jpg",
					"description": {
                        "nl": "",
                        "en": ""
                    }
                },
                {
                    "img_url": "3.jpg",
					"description": {
                        "nl": "",
                        "en": ""
                    }
                },
                {
                    "img_url": "4.jpg",
					"description": {
                        "nl": "",
                        "en": ""
                    }
                }
            ],
            "iframe": [
                {
                    "yt_url": "https://www.youtube-nocookie.com/embed/KAYTMhcpcGI?rel=0"
                }
            ]
        },
        {
            "slug": "harmonie-ovu-website",
            "year": "2022",
            "preview_img_url": "harmonie-ovu-website-preview.jpg",
            "tumbnail_img_url": "harmonie-ovu-website-tumbnail.jpg",
            "category": "WEBSITE",
            "title": "HARMONIE-OVU.NL",
            "made_by": "Dylan Wintermans",
            "language": "HTML, CSS, JS, PHP & SQL",
            "description": {
                "nl": "Deze website bevat een afgesloten gedeelte voor leden en beheerders. Leden kunnen, wanneer ingelogd, muziek downloaden en de agenda inzien. Beheerders kunnen accounts aanmaken, muziek uploaden, foto's/albums uploaden en de agenda bijwerken. De website heeft gemiddeld 50 tot 60 bezoekers per dag. Dit was mijn eerste officiële project.",
                "en": "This website contains a closed section for members and administrators. Members, when logged in, can download music and view the calendar. Administrators can create accounts, upload music, upload photos/albums, and update the calendar. The website has an average of 50 to 60 visitors per day. This was my first official project."
            },
			"images": [
                {
                    "img_url": "home.jpg",
					"description": {
                        "nl": "<a href=\"https://harmonie-ovu.nl/\" target=\"_blank\" style='color: black;'><u>Harmonie-ovu.nl</u> 🗗</a>",
                        "en": "<a href=\"https://harmonie-ovu.nl/\" target=\"_blank\" style='color: black;'><u>Harmonie-ovu.nl</u> 🗗</a>"
                    }
                },
                {
                    "img_url": "album.jpg",
					"description": {
                        "nl": "Fotoalbums aangemaakt door beheerders van de vereniging.",
                        "en": "Photo albums created by administrators of the organization."
                    }
                },
                {
                    "img_url": "home-leden.jpg",
					"description": {
                        "nl": "Homepagina voor ingelogde leden met toegang tot de agenda en muziekpartijen.",
                        "en": "Home page for logged-in members with access to calendar and music sheets."
                    }
                },
                {
                    "img_url": "profiel.jpg",
					"description": {
                        "nl": "Profiel van een beheerder, deze beheerder heeft specifiek toegang tot accounts.",
                        "en": "Profile of an administrator, who has specific access to accounts."
                    }
                },
                {
                    "img_url": "accounts.jpg",
					"description": {
                        "nl": "Opties die een beheerder heeft voor het aanmaken van een account.",
                        "en": "Options an administrator has for creating an account."
                    }
                }
            ]
        },
        {
            "slug": "mario-platformer-python",
            "year": "2021",
            "preview_img_url": "mario-platformer-python-preview.jpg",
            "tumbnail_img_url": "mario-platformer-python-tumbnail.jpg",
            "category": "GAME",
            "title": "MARIO PLATFORMER",
            "made_by": "Casper Smets & Dylan Wintermans",
            "language": "Python",
			"description": {
                "nl": "2D platformer game gemaakt met Python. Dit was een groepsopdracht voor het vak programmeren. De game bevat een level waar je doorheen kan lopen en als je in contact komt met lava begint het level opnieuw.",
                "en": "2D platformer game made with Python. This was a group assignment for our programming class. The game contains a level you can walk through and if you come into contact with lava the level starts over."
            },
            "images": [
                {
                    "img_url": "achtergrond.jpg",
					"description": {
                        "nl": "De achtergrondafbeelding die is gebruikt om het spel meer detail te geven.",
                        "en": "The background image we used to give the game more detail."
                    }
                }
            ],
            "iframe": [
                {
                    "yt_url": "https://www.youtube-nocookie.com/embed/6ud5eco8ku8?rel=0"
                }
            ]
        },
        {
            "slug": "mario-platformer-construct3",
            "year": "2020",
            "preview_img_url": "mario-platformer-construct3-preview.jpg",
            "tumbnail_img_url": "mario-platformer-construct3-tumbnail.jpg",
            "category": "GAME",
            "title": "MARIO PLATFORMER",
            "made_by": "Dylan Wintermans",
            "language": "Construct 3",
			"description": {
                "nl": "2D platformer game gemaakt in Construct 3. Dit was een opdracht voor het keuzevak informatica wat ik in 4 havo heb gevolgd.",
                "en": "2D platformer game made in Construct 3. This was an assignment for the computer science class I took in high school."
            },
            "images": [
                {
                    "img_url": "lvl2.jpg",
					"description": {
                        "nl": "Construct 3 Mario Platformer",
                        "en": "Construct 3 Mario Platformer"
                    }
                },
                {
                    "img_url": "lvl1.1.jpg",
					"description": {
                        "nl": "Level 1 (1)",
                        "en": "Level 1 (1)"
                    }
                },
                {
                    "img_url": "lvl1.2.jpg",
					"description": {
                        "nl": "Level 1 (2)",
                        "en": "Level 1 (2)"
                    }
                },
                {
                    "img_url": "lvl2.1.jpg",
					"description": {
                        "nl": "Level 2 (1)",
                        "en": "Level 2 (1)"
                    }
                },
                {
                    "img_url": "lvl2.2.jpg",
					"description": {
                        "nl": "Level 2 (2)",
                        "en": "Level 2 (2)"
                    }
                },
                {
                    "img_url": "lvl3.jpg",
					"description": {
                        "nl": "Level 3",
                        "en": "Level 3"
                    }
                },
                {
                    "img_url": "codesnippet.jpg",
					"description": {
                        "nl": "Blockcode",
                        "en": "Blockcode"
                    }
                }
            ],
            "iframe": [
                {
                    "yt_url": "https://www.youtube-nocookie.com/embed/BpFm36uGjLw?rel=0"
                }
            ]
        }
    ]
}